import * as React from "react";

export default function Instructions() {
    return (
        <div
            style={{
                flex: 1,
                display: "flex",
                flexDirection: "column",
                minHeight: "100vh", // Set minimum height to 100% of the viewport height
                backgroundColor: "#21213E",
            }}
        >
            <div style={{
                flex: 1,
                width: "50%",
                height: "400px", // Set a fixed height for the container
                margin: "auto",
                marginTop: "20px",
                marginBottom: "20px",
                padding: "20px",
                textAlign: "right",
                backgroundColor: "#f0e9a5",
                color: "black",
                overflowY: "auto", // Add a scrollbar when content overflows
            }}>
                <h1>המדריך</h1>
                <h2>הקדמה</h2>
                <p style={{ textAlign: "justify", direction: "rtl" }}>
                    ברכותינו על רכישת "המילון העולמי". תקוותנו שתפיקו ממנו את מלוא התועלת וההנאה תוך כדי רכישת
                    השפה האנגלית. <br /><br />

                    המילון הינו חדיש ועדכני וכולל חומר רב ומגוון שנלקט בקפידה ממילונים שונים, מספרי לימוד ומתרגומים
                    בנושאים שונים. הכרך מכיל אלפי מילים, צירופי לשון וביטויים שאינם מצויים לעת עתה בשום מילון אחר. <br /><br />

                    בעריכת המילון הושקעו מאמצים רבים כדי להתאימו לדוברי העברית, תוך מתן מענה נרחב לקשיים
                    שהתלמידים נתקלים בהם. המילון מאפשר שליפה מהירה של המילה הנחוצה ואיתור התרגום המדויק מתוך
                    שלל אפשרויות התרגום. <br /><br />

                    המילון מתאים לתלמידים בכל הכיתות, וגם לנבחנים במבחני הבגרות. <br /><br />

                    כדי להקל על המשתמשים במילון, רצוי לקרוא בעיון את הכללים הבאים:
                </p>


                <h2>כללי</h2>
                <p style={{ textAlign: "justify", direction: "rtl" }}>
                    המילון מחולק ל 3- חלקים:<br /><br />

                    מילון עברי-אנגלי, קטגוריות בעברית ומילון אנגלי-עברי.<br /><br />

                    כל הערכים מופיעים בסדר אלפביתי – לפי סדר הא'-ב' או ה- ABC , ללא ערכים משניים.
                    לדוגמה: הערך "דעת קהל" יופיע באות ד' ולא באות ק' כערך משני מתחת למילה קהל.<br /><br />

                    הקטגוריות כוללות כשלושים סיווגים שימושיים. לדוגמה: מזון, שדה התעופה, מושגי כלכלה וכו'. סיווגים אלה
                    מאפשרים שליפה מהירה של המילה הרצויה ללא צורך בחיפוש מסורבל ומייגע.
                </p>

                <h2>ניקוד</h2>
                <p style={{ textAlign: "justify", direction: "rtl" }}>
                    בחלק העברי-אנגלי:<br />

                    בחלק זה מנוקד הטקסט העברי לפי כללי הניקוד, אך כדי להקל על איתור הערך, נעשה שימוש בכתיב מלא

                    (המכונה "הכתיב חסר הניקוד"). לדוגמה: הערך דֹּאַר יופיע בניקוד ובתוספת ו"ו להקלת האיתור וייכתב כך:
                    דּוֹאַר. הערך סִכָּה ייכתב בניקוד ובתוספת יו"ד: סִיכָּה.<br /><br />

                    בחלק מהערכים נוספה האות יו”ד בהתאם לצורת הכתיב הנפוצה, כדי להקל על האיתור, אף על פי שלפי כללי<br /><br />

                    הכתיב המלא הן נכתבות בלא יו”ד. למשל: עֲבֵירָה, בְרֵירָה.
                    בחלק מהמילים הלועזיות נוספה האות אל"ף להקלת הקריאה והאיתור, לדוגמה: טאבו, חאקי וכו'.<br /><br />

                    בחלק האנגלי-עברי:<br />

                    כל המילים בעברית מנוקדות ניקוד מלא וכתובות בכתיב חסר לפי כללי הניקוד המקובלים.
                </p>

                <h2>פעלים</h2>
                <p style={{ textAlign: "justify", direction: "rtl" }}>
                    בחלק העברי-אנגלי:<br />
                    כל הפעלים והביטויים מופיעים כשם פועל באות למ"ד. לדוגמה: לאכול, לשתות, להעיף מבט.<br /><br />
                    בחלק האנגלי-עברי:<br />
                    בגוף המילון יופיעו כל הפעלים לפי סדר ה- .ABC<br />
                    הפעלים יוצאי הדופן יופיעו בנוסף בטבלה מרוכזת בסוף החלק האנגלי עברי של המילון.
                </p>

                <h2>תרגום</h2>
                <p style={{ textAlign: "justify", direction: "rtl" }}>
                    בשל ההבדלים בין התרגום האנגלי-אמריקאי לתרגום האנגלי-בריטי, הובאו התרגומים במילון בשתי
                    האפשרויות.<br /><br />
                    בחלק העברי-אנגלי:<br />
                    מילים בעלות תרגום שונה יסומנו ב 2- דגלונים - , והתרגום יופיע בסדר זה : אמריקאי-בריטי.<br /><br />
                    תרגומים נוספים הזהים באנגלית אמריקאית ובריטית יופיעו אחר כך.<br />
                    לדוגמה: הערך מעלית יתורגם .elevator ■ lift<br /><br />
                    בחלק האנגלי-עברי:<br />
                    ליד כל תרגום יופיע בסוגריים הדגלון והתרגום המקביל.<br />
                    לדוגמה: מעלית ) elevator -lift ולחילופין ) ( ( .lift -elevator<br /><br />
                    במשפחות מילים בעלות כתיב שונה בין האנגלית האמריקאית והבריטית, תופיע הצורה המקבילה רק
                    באחד מחלקי המשפחה.<br /><br />
                    לדוגמה: ( color ) -colour.
                </p>

                <h2>כללי?????</h2>
                <p style={{ textAlign: "justify", direction: "rtl" }}>
                    בחלק העברי-אנגלי
                    התרגומים השונים יופיעו לפי סדר השכיחות בשימוש בשפה.
                    כאשר קיימים תרגומים אחדים בעלי משמעות שונה לאותה המילה, יופיעו השימושים השונים בשורות
                    נפרדות.
                    לדוגמה: הוראה )מקצוע( teaching
                    הוראה )פקודה ( order
                    בחלק האנגלי-עברי
                    כל המילים השימושיות בשפה העברית, מתורגמות בתרגום עברי מלא.
                    לדוגמה: אֶטְיוֹלוֹגְיָה )חֵקֶר הַסִּ וֹּת לְמַחֲלוֹת( aetiology
                </p>

                <h2>תוספות</h2>
                <p style={{ textAlign: "justify", direction: "rtl" }}>
                    בצורתו הגרפית של המילון הושקעה מחשבה רבה כדי שיהיה ידידותי למשתמש. משום כך נוספו קווי<br /><br />
                    האורך והרוחב כדי לתחום את התרגום.<br /><br />
                    בראש הדף מופיעות המילה הראשונה והאחרונה בעמוד, כמקובל במילונים.
                </p>

                <p style={{ textAlign: "left", direction: "rtl" }}>
                    <br />
                    בתקווה שתפיקו את מלוא התועלת וההנאה,<br /><br />
                    ינטי הופמן
                </p>
            </div>
        </div>
    );
}